package com.company.task1;
//Написать программу, которая будет считывать документы (акты и договора) с консоли, сохранять их в массив и выводить
// конкретный документ по запросу:

     //   1) Предусмотреть ввод информации: количество считываемых документов, для каждого документа - тип и
//   необходимую информацию.
     //   2) Документы хранить в общем массиве (Подумать про использование полиморфизма)
     //  3) Предусмотреть вывод конкретного i-го документа на консоль. Для этого написать перегрузку метода toString().

public class Main {
}
